---
kind: property
id: P:Autodesk.Revit.DB.TableView.MaximumColumnWidth
source: html/be1f4325-50a6-0bf0-fbe6-59f3c58cefa3.htm
---
# Autodesk.Revit.DB.TableView.MaximumColumnWidth Property

Gets the maximum column width

## Syntax (C#)
```csharp
public int MaximumColumnWidth { get; }
```